results/run-100vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 100 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 100 VUs  0m00.7s/1m0s

running (0m01.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  0m01.7s/1m0s

running (0m02.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 100 VUs  0m02.7s/1m0s

running (0m03.7s), 100/100 VUs, 78 complete and 0 interrupted iterations
default   [   6% ] 100 VUs  0m03.7s/1m0s

running (0m04.7s), 100/100 VUs, 138 complete and 0 interrupted iterations
default   [   8% ] 100 VUs  0m04.7s/1m0s

running (0m05.7s), 100/100 VUs, 209 complete and 0 interrupted iterations
default   [   9% ] 100 VUs  0m05.7s/1m0s

running (0m06.7s), 100/100 VUs, 268 complete and 0 interrupted iterations
default   [  11% ] 100 VUs  0m06.7s/1m0s

running (0m07.7s), 100/100 VUs, 344 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  0m07.7s/1m0s

running (0m08.7s), 100/100 VUs, 408 complete and 0 interrupted iterations
default   [  14% ] 100 VUs  0m08.7s/1m0s

running (0m09.7s), 100/100 VUs, 476 complete and 0 interrupted iterations
default   [  16% ] 100 VUs  0m09.7s/1m0s

running (0m10.7s), 100/100 VUs, 535 complete and 0 interrupted iterations
default   [  18% ] 100 VUs  0m10.7s/1m0s

running (0m11.7s), 100/100 VUs, 615 complete and 0 interrupted iterations
default   [  19% ] 100 VUs  0m11.7s/1m0s

running (0m12.7s), 100/100 VUs, 676 complete and 0 interrupted iterations
default   [  21% ] 100 VUs  0m12.7s/1m0s

running (0m13.7s), 100/100 VUs, 742 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  0m13.7s/1m0s

running (0m14.7s), 100/100 VUs, 804 complete and 0 interrupted iterations
default   [  24% ] 100 VUs  0m14.7s/1m0s

running (0m15.7s), 100/100 VUs, 872 complete and 0 interrupted iterations
default   [  26% ] 100 VUs  0m15.7s/1m0s

running (0m16.7s), 100/100 VUs, 945 complete and 0 interrupted iterations
default   [  28% ] 100 VUs  0m16.7s/1m0s

running (0m17.7s), 100/100 VUs, 1007 complete and 0 interrupted iterations
default   [  29% ] 100 VUs  0m17.7s/1m0s

running (0m18.7s), 100/100 VUs, 1070 complete and 0 interrupted iterations
default   [  31% ] 100 VUs  0m18.7s/1m0s

running (0m19.7s), 100/100 VUs, 1142 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  0m19.7s/1m0s

running (0m20.7s), 100/100 VUs, 1207 complete and 0 interrupted iterations
default   [  34% ] 100 VUs  0m20.7s/1m0s

running (0m21.7s), 100/100 VUs, 1266 complete and 0 interrupted iterations
default   [  36% ] 100 VUs  0m21.7s/1m0s

running (0m22.7s), 100/100 VUs, 1339 complete and 0 interrupted iterations
default   [  38% ] 100 VUs  0m22.7s/1m0s

running (0m23.7s), 100/100 VUs, 1396 complete and 0 interrupted iterations
default   [  39% ] 100 VUs  0m23.7s/1m0s

running (0m24.7s), 100/100 VUs, 1468 complete and 0 interrupted iterations
default   [  41% ] 100 VUs  0m24.7s/1m0s

running (0m25.7s), 100/100 VUs, 1533 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  0m25.7s/1m0s

running (0m26.7s), 100/100 VUs, 1596 complete and 0 interrupted iterations
default   [  44% ] 100 VUs  0m26.7s/1m0s

running (0m27.7s), 100/100 VUs, 1657 complete and 0 interrupted iterations
default   [  46% ] 100 VUs  0m27.7s/1m0s

running (0m28.7s), 100/100 VUs, 1718 complete and 0 interrupted iterations
default   [  48% ] 100 VUs  0m28.7s/1m0s

running (0m29.7s), 100/100 VUs, 1787 complete and 0 interrupted iterations
default   [  49% ] 100 VUs  0m29.7s/1m0s

running (0m30.7s), 100/100 VUs, 1846 complete and 0 interrupted iterations
default   [  51% ] 100 VUs  0m30.7s/1m0s

running (0m31.7s), 100/100 VUs, 1917 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  0m31.7s/1m0s

running (0m32.7s), 100/100 VUs, 1978 complete and 0 interrupted iterations
default   [  54% ] 100 VUs  0m32.7s/1m0s

running (0m33.7s), 100/100 VUs, 2045 complete and 0 interrupted iterations
default   [  56% ] 100 VUs  0m33.7s/1m0s

running (0m34.7s), 100/100 VUs, 2103 complete and 0 interrupted iterations
default   [  58% ] 100 VUs  0m34.7s/1m0s

running (0m35.7s), 100/100 VUs, 2173 complete and 0 interrupted iterations
default   [  59% ] 100 VUs  0m35.7s/1m0s

running (0m36.7s), 100/100 VUs, 2239 complete and 0 interrupted iterations
default   [  61% ] 100 VUs  0m36.7s/1m0s

running (0m37.7s), 100/100 VUs, 2308 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  0m37.7s/1m0s

running (0m38.7s), 100/100 VUs, 2366 complete and 0 interrupted iterations
default   [  64% ] 100 VUs  0m38.7s/1m0s

running (0m39.7s), 100/100 VUs, 2436 complete and 0 interrupted iterations
default   [  66% ] 100 VUs  0m39.7s/1m0s

running (0m40.7s), 100/100 VUs, 2502 complete and 0 interrupted iterations
default   [  68% ] 100 VUs  0m40.7s/1m0s

running (0m41.7s), 100/100 VUs, 2565 complete and 0 interrupted iterations
default   [  69% ] 100 VUs  0m41.7s/1m0s

running (0m42.7s), 100/100 VUs, 2629 complete and 0 interrupted iterations
default   [  71% ] 100 VUs  0m42.7s/1m0s

running (0m43.7s), 100/100 VUs, 2693 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  0m43.7s/1m0s

running (0m44.7s), 100/100 VUs, 2761 complete and 0 interrupted iterations
default   [  74% ] 100 VUs  0m44.7s/1m0s

running (0m45.7s), 100/100 VUs, 2827 complete and 0 interrupted iterations
default   [  76% ] 100 VUs  0m45.7s/1m0s

running (0m46.7s), 100/100 VUs, 2896 complete and 0 interrupted iterations
default   [  78% ] 100 VUs  0m46.7s/1m0s

running (0m47.7s), 100/100 VUs, 2962 complete and 0 interrupted iterations
default   [  79% ] 100 VUs  0m47.7s/1m0s

running (0m48.7s), 100/100 VUs, 3019 complete and 0 interrupted iterations
default   [  81% ] 100 VUs  0m48.7s/1m0s

running (0m49.7s), 100/100 VUs, 3092 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  0m49.7s/1m0s

running (0m50.7s), 100/100 VUs, 3146 complete and 0 interrupted iterations
default   [  84% ] 100 VUs  0m50.7s/1m0s

running (0m51.7s), 100/100 VUs, 3215 complete and 0 interrupted iterations
default   [  86% ] 100 VUs  0m51.7s/1m0s

running (0m52.7s), 100/100 VUs, 3284 complete and 0 interrupted iterations
default   [  88% ] 100 VUs  0m52.7s/1m0s

running (0m53.7s), 100/100 VUs, 3337 complete and 0 interrupted iterations
default   [  89% ] 100 VUs  0m53.7s/1m0s

running (0m54.7s), 100/100 VUs, 3404 complete and 0 interrupted iterations
default   [  91% ] 100 VUs  0m54.7s/1m0s

running (0m55.7s), 100/100 VUs, 3470 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  0m55.7s/1m0s

running (0m56.7s), 100/100 VUs, 3532 complete and 0 interrupted iterations
default   [  94% ] 100 VUs  0m56.7s/1m0s

running (0m57.7s), 100/100 VUs, 3595 complete and 0 interrupted iterations
default   [  96% ] 100 VUs  0m57.7s/1m0s

running (0m58.7s), 100/100 VUs, 3649 complete and 0 interrupted iterations
default   [  98% ] 100 VUs  0m58.7s/1m0s

running (0m59.7s), 100/100 VUs, 3724 complete and 0 interrupted iterations
default   [  99% ] 100 VUs  0m59.7s/1m0s

running (1m00.7s), 053/100 VUs, 3788 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s

running (1m01.7s), 004/100 VUs, 3837 complete and 0 interrupted iterations
default ↓ [ 100% ] 100 VUs  1m0s


  █ TOTAL RESULTS 

    checks_total.......: 3841    61.863365/s
    checks_succeeded...: 100.00% 3841 out of 3841
    checks_failed......: 0.00%   0 out of 3841

    ✓ status 200 байна

    HTTP
    http_req_duration..............: avg=263.07ms min=53.81ms med=221.43ms max=2.49s p(90)=744.45ms p(95)=787.56ms
      { expected_response:true }...: avg=263.07ms min=53.81ms med=221.43ms max=2.49s p(90)=744.45ms p(95)=787.56ms
    http_req_failed................: 0.00%  0 out of 7682
    http_reqs......................: 7682   123.726729/s

    EXECUTION
    iteration_duration.............: avg=1.57s    min=1.27s   med=1.39s    max=5.44s p(90)=1.98s    p(95)=2.25s   
    iterations.....................: 3841   61.863365/s
    vus............................: 4      min=4         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 15 MB  240 kB/s
    data_sent......................: 695 kB 11 kB/s



running (1m02.1s), 000/100 VUs, 3841 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  1m0s